Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The size of slice is determined by amount, which specifies the distance from edge.
ja: sliceの大きさは、amountによって決定され、それはedgeからの隔たりを指定します。

source: The size of the bytes.
ja: それらバイトのサイズ。

source: The size of the data.
ja: データのサイズ。

source: The smaller calendar component.
ja: より小さいカレンダー構成要素。

source: The smallest x coordinate value within a Rect.
ja: a Rect内部の最小のx座標。

source: The smallest y coordinate value within a Rect.
ja: a Rect内部の最小のy座標を返します。

source: The snapshot file remains available at the specified URL until the date specified in the out Date parameter, after which it is automatically deleted.
ja: スナップショットファイルは、out Dateパラメータで指定された日付まで、指定されたURLで利用可能なままです、それの後それは自動的に削除されます。

source: The snapshot reflects the contents of the file at the time the URL was generated and is not updated when subsequent changes are made to the original file in the user’s iCloud storage.
ja: スナップショットは、URLが生成された当時のファイルの内容を反映します、そしてその後に起こる変更がユーザのiCloudストレージ中の元のファイルになされた場合に更新されません。

source: The sort descriptors to use for sorting, as an array of NSSort Descriptor objects.
ja: ソートするために使われるソート記述、NSSort Descriptorオブジェクトからなる配列として。

source: The sorting algorithm is not stable.
ja: このソートアルゴリズムは、安定ではありません。

source: The span of time between a specific start date and end date.
ja: 特定の開始日付と終了日付の間の期間。

source: The specified block should not make any assumptions about its execution environment.
ja: 指定されたブロックは、それの実行環境について何らかの仮定をするべきではありません。

source: The specified date.
ja: 指定する日付。

source: The specified object or objects in the receiving container.
ja: 受け取っているコンテナの中の指定されたオブジェクトまたは複数オブジェクト。

source: The standalone month symbols for the receiver.
ja: レシーバに対する単独動作型の月シンボル。

source: The standalone quarter symbols for the receiver.
ja: レシーバに対する単独動作型の四半期シンボル。

source: The start date of the Gregorian calendar for the receiver.
ja: レシーバに対するグレゴリオ暦の開始日付。

source: The start date.
ja: 開始日付。

source: The start time.
ja: 開始時間。

source: The starting date components.
ja: 開始する日付構成要素。

source: The starting date.
ja: 開始日付。

source: The storage policy for the cached response.
ja: キャッシュされた応答に対するストレージ方針。

source: The strategies available for formatting dates when decoding them from JSON.
ja: それらをJSONからデコーディングする場合、日付を書式設定するために使用できる戦略。

source: The strategies for decoding raw data.
ja: 生のデータのデコードに対する戦略。

source: The strategies for encoding nonconforming floating-point numbers, also known as IEEE 754 exceptional values.
ja: IEEE 754例外値としても知られる、不適合浮動小数点数をエンコードすることに対する戦略。

source: The strategies for encoding raw data.
ja: 生のデータをエンコードするための戦略。

source: The strategy that a decoder uses to decode raw data.
ja: デコーダを使って生のデータをデコードする戦略。

source: The strategy that an encoder uses to encode raw data.
ja: エンコーダが生のデータをエンコードするために使う戦略。

source: The strategy that decodes data using Base 64 decoding.
ja: Base 64デコーディングを使ってデータをデコードする戦略。

source: The strategy that decodes data using a user-defined function.
ja: ユーザ定義の関数を使ってデータをデコードする戦略。

source: The strategy that decodes dates in terms of milliseconds since midnight UTC on January 1st, 1970.
ja: 1970年１月１日でのUTC午前０時からのミリ秒の観点から日付をデコードする戦略。

source: The strategy that decodes dates in terms of seconds since midnight UTC on January 1st, 1970.
ja: 1970年１月１日でのUTC午前０時からの秒の観点から日付をデコードする戦略。

source: The strategy that decodes exceptional floating-point values from a specified string representation.
ja: 例外浮動小数点値を指定された文字列表現からデコードする戦略。

source: The strategy that defers formatting settings to a supplied date formatter.
ja: 書式設定の設定を提供された日付フォーマッタに任せる戦略。

source: The strategy that encodes data using Base 64 encoding.
ja: Base 64エンコーディングを使ってデータをエンコードする戦略。

source: The strategy that encodes data using a user-defined function.
ja: ユーザ定義関数を使ってデータをデコードする戦略。

source: The strategy that encodes data using the encoding specified by the data instance itself.
ja: データインスタンスそれ自身によって指定されるエンコーディングを使ってデータをエンコードする戦略。

source: The strategy that encodes dates in terms of milliseconds since midnight UTC on January 1, 1970.
ja: 1970年１月１日でのUTC午前０時からのミリ秒の観点から日付をエンコードする戦略。

source: The strategy that encodes dates in terms of seconds since midnight UTC on January 1, 1970.
ja: 1970年１月１日でのUTC午前０時からの秒の観点から日付をエンコードする戦略。

source: The strategy that formats custom dates by calling a user-defined function.
ja: ユーザ定義関数を呼び出すことによってあつらえの日付を書式設定する戦略。

source: The strategy that formats dates according to the ISO 8601 and RFC 3339 standards.
ja: ISO 8601 および RFC 3339 規格によって日付を書式設定する戦略。

source: The strategy that formats dates according to the ISO 8601 standard.
ja: 日付をISO 8601規格によって書式設定する戦略。

source: The strategy that throws an error upon decoding an exceptional floating-point value.
ja: 例外浮動小数点値をデコードする上でのエラーをスローする戦略。

source: The strategy that uses formatting from the Date structure.
ja: Date構造体から書式設定するのに使う戦略。

source: The strategy used by a decoder when it encounters exceptional floating-point values.
ja: それが例外浮動小数点値に出くわす場合にデコーダによって使われる戦略。

source: The strategy used by an encoder when it encounters exceptional floating-point values.
ja: それが例外浮動小数点値に出くわす場合にエンコーダによって使われる戦略。

source: The strategy used when decoding dates from part of a JSON object.
ja: JSONオブジェクトの部分から日付をデコードする場合に使われる戦略。

source: The strategy used when encoding dates as part of a JSON object.
ja: JSONオブジェクトの部分として日付をエンコードする場合に使われる戦略。

source: The stream must be opened before it can be used.
ja: ストリームは、それが使われる前に開かれなければなりません。

source: The string content to inspect for characters.
ja: 文字を点検することになる文字列内容。

source: The string encoding associated with this error, if any.
ja: このエラーと関連する文字列エンコーディング、もしあれば。

source: The string from which the result was matched.
ja: 結果がそこからマッチされた、もとの文字列。

source: The string to parse.
ja: 構文解析する文字列。

source: The string to search for values within.
ja: 値を捜す文字列。

source: The string to search.
ja: 捜す文字列。

source: The string you specify is based on the Unicode Technical Standard #35, which uses characters to represent the day, time, year, hour, minute, and other pieces of date or time information.
ja: あなたが指定する文字列は、Unicode Technical Standard #35に基づきます、それは幾らかの文字を使って日、時刻、年、時、分、そして日付または時刻情報の他の断片を表します。

source: The string you specify must not contain wildcards and must be of the form <TEAMID>.<CONTAINER>, where <TEAMID> is your development team ID and <CONTAINER> is the bundle identifier of the container you want to access.
ja: あなたが指定する文字列は、ワイルドカードを含んではなりません、そして形式<TEAMID>.<CONTAINER>のものでなければなりません、そこで<TEAMID>はあなたの開発チームIDで<CONTAINER>はあなたがアクセスを望むコンテナのバンドル識別子です。

source: The string you use as a raw value for each enumeration case is the key name used during encoding and decoding.
ja: あなたが各列挙節に対して生の値として使う文字列は、エンコーディングおよびデコーディングの間に使うキー名です。

source: The string.
ja: 文字列。

source: The strings are ordered according to the user's language preferences and available localizations.
ja: これら文字列は、ユーザの言語環境設定と利用可能なローカライゼーションに従って順番付けられます。

source: The style for the resulting units.
ja: 結果の単位に対するスタイル。

source: The style to use when formatting day, month, and year information.
ja: 日、月、そして年情報を書式設定する時に使うスタイル。

source: The style to use when formatting hour, minute, and second information.
ja: 時、分、そして秒情報を書式設定する時に使うスタイル。

source: The subrange of the collection to replace.
ja: 置き換えることになるコレクションの下位範囲。

source: The subscript notation is preferred over prefix(through:).
ja: 添え字表記法は、prefix(through:)よりも好まれます。

source: The subscript notation is preferred over suffix(from:).
ja: 添え字表記法は、suffix(from:)よりも好まれます。

source: The subscript notation is preferred over prefix(up To:).
ja: 添え字表記法は、prefix(up To:)よりも好まれます。

source: The substitution template used when replacing matching instances.
ja: マッチするインスタンスを取り替えるときに使われる置換用テンプレート。

source: The sum of the location and length of the range—that is, range .location + range .length.
ja: 範囲の位置と長さの合計 — すなわち、range .location + range .length。

source: The supported format specifiers are described in String Format Specifiers.
ja: サポートされるフォーマット指定子は、String Format Specifiersで記述されます。

source: The supported values are described in File Manager .Search Path Directory.
ja: サポートされる値は、File Manager .Search Path Directoryで記述されます。

source: The suspended event is no longer the current event after this method returns.
ja: 休止されたイベントは、このメソッドが返った後もはや現在のイベントではありません。

source: The symbol used to represent the unit.
ja: 単位を表すために使われるシンボル。

source: The symbol used to represent “AM”, localized to the Calendar’s locale.
ja: “AM” を表すために使われるシンボル、Calendarの持つlocaleにローカライズされます。

source: The symbol used to represent “PM”, localized to the Calendar’s locale.
ja: “PM” を表すために使われるシンボル、Calendarの持つlocaleにローカライズされます。

source: The system also creates the Library/Application Support, Library/Caches, and Library/Preferences subdirectories inside the group directory the first time you use it.
ja: システムはまた、Library/Application Support、Library/Caches、そしてLibrary/Preferences下位ディレクトリをグループディレクトリの内部にあなたがそれを最初に使う時に作成します。

source: The system creates only the Library/Caches subdirectory automatically, but you can create others yourself if you need them.
ja: システムは、ただLibrary/Caches下位ディレクトリだけを自動的に作成します、しかしあなたは他のものをあなた自身で作成できます、あなたがそれらを必要とするならば。

source: The system creates this directory automatically the first time your app needs it and never removes it.
ja: システムは、このディレクトリをあなたのアプリがそれを必要とする最初の時に自動的に作成します、そして決してそれを除去しません。

source: The system passes this block the following parameters:
ja: システムは、このブロックに以下のパラメータに渡します：

source: The system will attempt to purge resources with lower priorities first.
ja: システムは、より低い優先度を持つリソースを最初に除去しようとします。

source: The table’s size is dependent on (but generally not equal to) capacity.
ja: テーブルのサイズは、capacityに依存します（しかし一般的に等しくはありません）。

source: The template for formatting one date and time value.
ja: １つの日付と時刻値を書式設定するための雛型。

source: The template specifies what is to be used to replace each match, with $0 representing the contents of the overall matched range, $1 representing the contents of the first capture group, and so on.
ja: テンプレートは、全体的なマッチされた範囲の内容を表す$0、そして最初の捕獲グループ内容を表す$1、などが保持する、各マッチを置換するために何が使われることになるか指定します。

source: The template string
ja: テンプレート文字列

source: The text currently in a cell.
ja: 現在セルの中にあるテキスト。

source: The text of capture group n will be substituted for $n.
ja: 捕獲グループnのテキストは、$nで代用されます。

source: The thread on which to execute a Selector.
ja: それの上でa Selectorが実行されるスレッド。

source: The time interval between the date value and the current date and time.
ja: 日付値と現在の日付と時刻の間の時間間隔。

source: The time interval, measured in seconds.
ja: 時間の隔たり、秒で計られる。

source: The time style of the receiver.
ja: レシーバの時間スタイル。

source: The time zone for the receiver.
ja: レシーバに対するタイムゾーン。

source: The time zone of the calendar.
ja: カレンダーのタイムゾーン。

source: The time zone overrides the time zone of the Calendar for the purposes of this calculation.
ja: タイムゾーンは、この計算の目的のためにCalendarのタイムゾーンをオーバーライドします。

source: The time zone used to create and parse date representations.
ja: 日付表現の作成と構文解析に使われるタイムゾーン。

source: The time zone with which to specify time values.
ja: それで時間値を指定することになるタイムゾーン。

source: The timer is configured to run in the default mode (NSDefault Run Loop Mode).
ja: このタイマーは、デフォルト（初期状態、省略時、特に何もしない場合）のモード（NSDefault Run Loop Mode）で実行されるように設定されます。

source: The timer is configured to run in the modes specified by the modes parameter.
ja: このタイマーは、modesによって指定されたのモードで実行されるように設定されます。

source: The top-level repository of scriptability information for an app at runtime.
ja: あるアプリに対する実行時でのスクリプト対応機能情報のトップレベルレポジトリ（最高水準貯蔵所）。

source: The transaction ID to be set in the returned descriptor.
ja: 返される記述子の中に設定されるトランザクションID。

source: The transform object whose matrix values should be copied to this object.
ja: 変換オブジェクト、それの行列の値がこのオブジェクトにコピーされます。

source: The two loops in the following example produce the same output:
ja: 以下の例における２つのループは、同じ出力を生み出します：

source: The two operands are equal.
ja: ２つの演算数は等しい。

source: The type adopts Codable so that it's decodable using a JSONDecoder instance.
ja: この型はCodableを採用します、それでそれはJSONDecoderインスタンスを使ってデコード可能です。

source: The type adopts Codable so that it's encodable as JSON using a JSONEncoder instance.
ja: この型はCodableを採用します、それでそれはJSONEncoderインスタンスを使ってエンコード可能です。

source: The type must match the type of the property identified by key.
ja: その型は、keyによって識別されるプロパティの型と一致しなければなりません。

source: The type of the value to decode from the supplied JSON object.
ja: 供給されたJSONオブジェクトからデコードすることになる値の型。

source: The type value to be set in the returned descriptor.
ja: 返される記述子の中に設定される型値。

source: The types of sound files can be determined by calling the sound Unfiltered File Types method of NSSound.
ja: サウンドファイルの型は、NSSoundのsound Unfiltered File Typesメソッドを呼び出すことによって特定されます。

source: The underlying error behind this error, if any.
ja: このエラーの背後にある基底エラー、もしあれば。

source: The unit converter used to represent the unit in terms of the dimension’s base unit.
ja: 寸法の持つ基本単位に基づいて単位を表すために使われる単位コンバータ。

source: The unit in the last place of the decimal.
ja: この10進数の最終桁単位。

source: The unit is represented in the shortest notation available.
ja: 単位は、可能な最も短い表記法で表されます。

source: The unit style used by this formatter.
ja: フォーマッタによって使われる単位スタイル。

source: The unit to use in the resulting energy string.
ja: 結果のエネルギー文字列で使う単位。

source: The unit used in the resulting energy string.
ja: 結果のエネルギー文字列で使われる単位。

source: The units supported by the NSEnergy Formatter class.
ja: NSEnergy Formatterクラスによってサポートされる単位。

source: The upper bound for the range.
ja: 範囲の上側の境界。

source: The use of the NSURL class is generally preferred for specifying file-system items because they can convert path information to a more efficient representation internally.
ja: NSURLクラスは、様々なファイルシステム項目を指定するのに一般的に好まれます、なぜならそれらはパス情報を内部的にもっと効率の良い表現に変換できるからです。

source: The username of the owner of the desired home directory.
ja: 要望されたホームディレクトリの所有者のユーザ名。

source: The user’s current calendar.
ja: ユーザの持つ現在のカレンダー。

source: The user’s home directory—the place to install user’s personal items (~).
ja: ユーザのホームディレクトリ — ユーザの個人的項目をインストールする場所（~）。

source: The value assigned to that key is an NSURL object with the location of the item.
ja: そのキーに割り当てられた値は、項目の場所を持つNSURLオブジェクトです。

source: The value associated with key in the receiver's property list (Info .plist).
ja: レシーバの持つプロパティリスト（Info .plist）の中のkeyと関連付けられる値。

source: The value associated with this case is a closure you use to choose the names of keys in the encoded JSON object.
ja: このケース節と結び付けられる値は、あなたがキーの名前をエンコード済JSONオブジェクトにおいて選択するために使うクロージャです。

source: The value associated with this case is a closure you use to map names of keys from the decoded JSON object to the names of your type's coding keys.
ja: このケース節と結び付けられる値は、あなたがキーの名前をデコード済JSONオブジェクトからあなたの型の持つコーディングキーにまでマップするために使うクロージャです。

source: The value corresponds to the value of st_dev, as returned by stat(2).
ja: この値は、st_devの値に相当します、stat(2)によって返されるのと同じ。

source: The value corresponds to the value of st_ino, as returned by stat(2).
ja: この値は、st_inoの値に相当します、stat(2)によって返されるのと同じ。

source: The value for the component.
ja: その構成要素に対する値。

source: The value for this parameter is one of the constants described in File Manager .Search Path Domain Mask.
ja: このパラメータの値は、File Manager .Search Path Domain Maskで記述される定数の１つです。

source: The value for this parameter is one or more of the constants described in File Manager .Search Path Domain Mask.
ja: このパラメータに対する値は、File Manager .Search Path Domain Maskで記述される１つ以上の定数です。

source: The value in this parameter must not be nil.
ja: このパラメータの中の値は、nilであってはいけません。

source: The value is determined by statfs().
ja: 値は、statfs()によって決定されます。

source: The value must be a finite number.
ja: 値は、有限数でなければなりません。

source: The value must be less than the original data buffer's length.
ja: この値は、元のデータバッファの持つ長さより少なくなければなりません。

source: The value of the accessibility element, in a localized string.
ja: ローカライズされた文字列での、アクセシビリティ要素の値。

source: The value of the item element of the index path.
ja: インデックスパスの項目要素の値。

source: The value of the row element of the index path.
ja: インデックスパスの列要素の値。

source: The value of the section element of the index path.
ja: インデックスパスのセクション要素の値。

source: The value of the specified component to add.
ja: 加えることになる指定された構成要素の値。

source: The value passed as n must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれらの境界を越えて補うのを防止するのでない限りは。

source: The value passed as n must not offset i beyond the bounds of the collection.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value returned in alignp is the aligned size of the data type; for example, on some platforms, the aligned size of a char might be 2 bytes while the actual physical size is 1 byte.
ja: alignpで返される値は、データ型のアラインされるサイズです；例えば、いくつかのプラットホーム上で、charのアラインされるサイズは２バイト、一方で実際の物理サイズは１バイトかもしれません。

source: The value that table maps to key, or NULL if table doesn’t contain key.
ja: tableがkeyと対応させる値、またはNULL、もしtableがkeyを含まないならば。

source: The value that represents "not a number."
ja: "非数" を表す値。

source: The value to add, in seconds.
ja: この値を加えます、秒で。

source: The value to coerce.
ja: この値に強制を行います。

source: The value to encode.
ja: エンコードする値。

source: The value to format.
ja: この値を書式設定します。

source: The value to use as the initial accumulating value.
ja: 初めから蓄積される値として使われる値。

source: The values can be combined using the C-bitwise OR operator.
ja: 値は、C-bitwise OR演算子を使用して結合されることができます。

source: The values of many four-character codes used by Apple (and in some cases reused by developers) can be found in AppleScript Terminology and Apple Event Codes.
ja: Appleによって使われる（そしていくつかの場合には開発者によって再利用される）たくさんの４文字コードの値は「AppleScript用語」と「Apple Eventコード」で見つけられます。

source: The values of the dictionary must be Objective-C objects that are convertible to NSApple Event Descriptor objects.
ja: 辞書の値は、NSApple Event Descriptorオブジェクトと変換できるObjective-Cオブジェクトでなければなりません。

source: The values that can be returned in a change dictionary.
ja: ある変更辞書において返されることが可能な値。

source: The values that determine how a type's coding keys are decoded from JSON keys.
ja: ある型の持つコーディングキーがJSONキーからデコードされる方法を決定する幾つかの値。

source: The values that determine how a type's coding keys are encoded as JSON keys.
ja: ある型の持つコーディングキーがJSONキーとしてエンコードされる方法を決定する幾つかの値。

source: The version number applies to NSArchiver/NSUnarchiver, but not to NSKeyed Archiver/NSKeyed Unarchiver.
ja: バージョン数はNSArchiver/NSUnarchiverに適用されます、しかしNSKeyed Archiver/NSKeyed Unarchiverには適用されません。

source: The version number assigned to the class.
ja: そのクラスに割り当てられたバージョン数。

source: The version number for the receiver.
ja: レシーバのバージョンナンバー。

source: The version number is helpful when instances of the class are to be archived and reused later.
ja: バージョン数は、そのクラスのインスタンスがアーカイブされて後で再利用されるときに役に立ちます。

source: The version of the Foundation framework in which NSFile Manager first supported resource forks.
ja: そこにおいてNSFile Managerが最初にリソースフォークをサポートしたFoundationフレームワークのバージョン。

source: The version of the HTTP response as returned by the server.
ja: HTTP応答のバージョン、サーバによって返されるままでの。

source: The very short month symbols for the receiver.
ja: レシーバに対する非常に短い月シンボル。

source: The volume could not be unmounted because it is in use.
ja: それが使用中であるのが原因でボリュームがアンマウントできなかった。

source: The volume could not be unmounted, reason unknown.
ja: ボリュームがアンマウントできなかった、理由不明。

source: The weekend starts strictly after the given date.
ja: 週末は、与えられた値の厳密に後で開始します。

source: The width of a Rect.
ja: a Rectの幅。

source: The wrapper object is otherwise a subclass of NSProxy and forwards messages to the original receiver object as an NSProxy does.
ja: このラッパーオブジェクトは、他の点ではNSProxyのサブクラスであり、メッセージをオリジナルのレシーバオブジェクトにNSProxyがするように転送します。

source: The y coordinate of a Rect’s center point.
ja: a Rectの中心点のy座標。

source: The zone in which to create the new instance (pass NULL to specify the default zone).
ja: そこにおいて新しいインスタンスを作成することになるゾーン（NULLを渡して省略時のゾーンを指定してください）。

source: The “past the end” index of the resulting subsequence.
ja: 結果のシーケンスの「終わりを過ぎた」インデックス。

source: There are a number of common directories available in the File Manager .Search Path Directory, including: desktop Directory, application Support Directory, and many more.
ja: File Manager .Search Path Directoryにおいて利用可能なたくさんの一般的なディレクトリがあり、含んでいるのは：desktop Directory、application Support Directory、そしてさらに多く。

source: There are a number of options to acquire a formatted string for a date including: date formatters (see NSDateFormatter and Data Formatting Guide), and the Date function description(locale:).
ja: ある日付の書式設定された文字列を得るいくつかの選択肢があります、次を含みます：日付フォーマッタ（NSDateFormatterとData Formatting Guideを見てください）、そしてDate関数のdescription(locale:)。

source: There are additional convenience methods for returning all the matches as an array, the total number of matches, the first match, and the range of the first match.
ja: マッチの全てを、マッチの総数、最初のマッチ、そして最初のマッチの範囲の配列として返す、いっそう便利なメソッドもあります。

source: There are four possible rounding modes:
ja: ４つの可能な丸めモードがあります：

source: There are four possible values for rounding Mode: down, up, plain, and bankers.
ja: ４つの可能な値がrounding Modeに対してあります：down、up、plain、そしてbankers。

source: There are three types of file wrappers:
ja: ３つの方のファイルラッパーがあります：

source: There are ultimately implementation-defined limits in how far distant the search will go.
ja: どのくらい遠い隔たりを検索が進むのかにおいて根本的に実装定義の限界があります。

source: There is a small performance penalty when the file is created and opened, though not when being written to or read from.
ja: ファイルが作成および開かれる場合に、書き込みまたは読み出しする場合でないにもかかわらず、小さな性能代償があります。

source: There is one standard error file handle per process; it is a shared instance.
ja: １つの標準エラーファイルハンドルがプロセス毎にあります；それはある共有インスタンスです。

source: There is one standard input file handle per process; it is a shared instance.
ja: １つの標準入力ファイルハンドルがプロセス毎にあります；それは共有インスタンスです。

source: There is one standard output file handle per process; it is a shared instance.
ja: １つの標準出力ファイルハンドルがプロセス毎にあります；それはある共有インスタンスです。

source: There is typically little reason to subclass NSArray.
ja: NSArrayのサブクラスを作る理由は一般的にほとんどありません。

source: There may be different types of distributed notification centers.
ja: 分散通知センターの異なる型があるかもしれません。

source: There will be at least one intervening date which does not match all the components (or the given date itself must not match) between the given date and any result.
ja: 与えられた日付と何らかの結果の間で、全ての構成要素に合致しない（また与えられた日付それ自体は合致してはならない）少なくとも１つの、間にある日付があります。

source: Therefore be sure to test that you can successfully access the returned URL before using it.
ja: それゆえにあなたが返されるURLにうまくアクセスできることをそれを使う前にテストするのを確実にしてください。

source: Therefore, options is emptied and the intersection between .express and options is returned.
ja: したがって、optionsは空にされて.expressとoptionsの間の交叉が返されます。

source: Therefore, it is usually best to only use this initializer when you either enforce immutability with let or ensure that no other references to the underlying data are formed.
ja: それゆえ、あなたがletを使って不変であることを強要するかまたは基底データへの他の参照が形成されないことを確実にするかのどちらかの場合にこのイニシャライザを使うだけであるのが通常は最良です。

source: Therefore, you are responsible for closing the file descriptor at some point after disposing of the file handle object.
ja: したがって、あなたはファイルハンドルオブジェクトを処分した後のある時点でファイル記述子を閉じることに責任があります。

source: Therefore, you must call those methods from your application’s main thread or from any thread where you have configured a run loop and are using it to process events.
ja: それゆえに、あなたはそれらのメソッドをあなたのアプリケーションのメインスレッドからまたはそこにおいてあなたが実行ループを構成設定してそれを使ってイベントを処理している何らかのスレッドから呼び出さなければなりません。

source: Therefore, you should always send remove Observer(_:) or remove Observer(_: name: object:) to the receiver before releasing notification Observer.
ja: それゆえに、あなたは常にremove Observer(_:)またはremove Observer(_: name: object:)をレシーバに送るべきです、notification Observerを解放する前にです。

source: These codes are associated with the ubiquitous Item Downloading Error Key on an NSURL object when an iCloud-related error occurs.
ja: これらのコードは、NSURLオブジェクト上のubiquitous Item Downloading Error Keyと、iCloud関連エラー発生時に関連付けられます。

source: These components cannot be used for path operations and are only suitable for display to the user.
ja: これらの構成要素は、パス演算に対して使用できません、そしてユーザに表示するために適しているだけです。
